/**
 * Created by Владислав on 10.11.2015.
 * Создать программу, которая реализует функцию деления по модулю (деление с остатком,
 * который является результатом и принимает значения 1 или 0).
 */
public class task2 {

    public static void main(String[] args) {

        int x = 38;
        x = x % 10;
        System.out.println(x);




    }
}
